const fetch = require('node-fetch');

const doc0 = `
كشفت تقارير صحافية، عن رغبة ليفربول الإنكليزي، في التعاقد مع سيرجيو راموس، قائد ريال مدريد، خلال الفترة المقبلة.

وقال برنامج "الشيرينغتو" الشهير إن ليفربول يريد التعاقد مع راموس لتدعيم خط دفاع الفريق، الذي يعاني كثيراً في ظل غياب فيرجيل فان دايك وغوميز وجويل ماتيب.

ولم يكشف التقرير الإسباني، عما إذا كان "الريدز"، يريد التعاقد مع راموس، خلال فترة الانتقالات الشتوية الحالية، أم سينتظر حتى نهاية عقده في الصيف المقبل."

وينتهي عقد راموس مع "الميرنغي" في نهاية الموسم الحالي، ولم يدخل في مفاوضات لتجديد عقده حتى الآن مع "الملكي"، كما يحق له الرحيل بالمجان عن فريقه في الصيف المقبل.

وارتبط قائد ريال مدريد، بالانتقال إلى العديد من الفرق، على رأسها باريس سان جيرمان الفرنسي، وبعض الفرق الإنكليزية والإيطالية.

`;

const method = process.argv[2];
// const n = parseInt(process.argv[3])

console.time('request-time')

fetch('http://0.0.0.0:5000/auto-tagging', {
    method: 'POST',
    body: JSON.stringify({
        text: doc0,
        method: method
    })
})
.then(async (res) => {
    console.log(await res.json());
    return true
})
.then(_ => console.timeEnd('request-time'))
.catch(err => console.log(err));